app/controllers/api/benches_controller.rb

    def create
        @bench = Bench.new(bench_params)
        if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "The temperpedic of benches"], ["lat", 37.0], ["lng", -122.333], ["created_at", "2019-05-27 18:41:00.002437"], ["updated_at", "2019-05-27 18:41:00.002437"]]