app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ZSpFpFm2Sx-kOMczQrpiow"], ["updated_at", "2019-05-24 20:02:29.750471"], ["id", 1]]
---
    def reset_session_token!
        self.update!(session_token: SecureRandom::urlsafe_base64)